web/application/files/fedex/wsdl/ShipService_v12/CreatePendingShipmentRequest_v12.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/ship/v12">
   <soapenv:Header/>
   <soapenv:Body>
      <v12:CreatePendingShipmentRequest>
         <v12:WebAuthenticationDetail>
            <v12:UserCredential>
               <v12:Key></v12:Key>
               <v12:Password/>
            </v12:UserCredential>
         </v12:WebAuthenticationDetail>
         <v12:ClientDetail>
            <v12:AccountNumber></v12:AccountNumber>
            <v12:MeterNumber></v12:MeterNumber>
         </v12:ClientDetail>
         <v12:TransactionDetail>
            <v12:CustomerTransactionId>CreatePendingRequest</v12:CustomerTransactionId>
         </v12:TransactionDetail>
         <v12:Version>
            <v12:ServiceId>ship</v12:ServiceId>
            <v12:Major>12</v12:Major>
            <v12:Intermediate>1</v12:Intermediate>
            <v12:Minor>0</v12:Minor>
         </v12:Version>
         <v12:RequestedShipment>
            <v12:ShipTimestamp>2012-08-18T09:30:47-05:00</v12:ShipTimestamp>
            <v12:DropoffType>REGULAR_PICKUP</v12:DropoffType>
            <v12:ServiceType>PRIORITY_OVERNIGHT</v12:ServiceType>
            <v12:PackagingType>YOUR_PACKAGING</v12:PackagingType>
            <v12:TotalWeight>
               <v12:Units>LB</v12:Units>
               <v12:Value>10.0</v12:Value>
            </v12:TotalWeight>
            <v12:Shipper>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Contact>
                  <v12:PersonName>FEDEX</v12:PersonName>
                  <v12:Title>FEDEX</v12:Title>
                  <v12:CompanyName>FedEx-WAPI</v12:CompanyName>
                  <v12:PhoneNumber>1234567890</v12:PhoneNumber>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>C/O ROCK BRANCH MECHANICAL</v12:StreetLines>
                  <v12:StreetLines>301 VIRGINIA ST E</v12:StreetLines>
                  <v12:City>CHARLESTON</v12:City>
                  <v12:StateOrProvinceCode>WV</v12:StateOrProvinceCode>
                  <v12:PostalCode>25301-2522</v12:PostalCode>
                  <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                  <v12:CountryCode>US</v12:CountryCode>
                  <v12:Residential>0</v12:Residential>
               </v12:Address>
            </v12:Shipper>
            <v12:Recipient>
               <v12:AccountNumber></v12:AccountNumber>
               <v12:Contact>
                  <v12:PersonName>Recipient Contact</v12:PersonName>
                  <v12:CompanyName>FEDEX</v12:CompanyName>
                  <v12:PhoneNumber>1234567890</v12:PhoneNumber>
               </v12:Contact>
               <v12:Address>
                  <v12:StreetLines>2121 WAYNOKA RD</v12:StreetLines>
                  <v12:StreetLines>503 S CYPRESS ST</v12:StreetLines>
                  <v12:City>LA HABRA</v12:City>
                  <v12:StateOrProvinceCode>CA</v12:StateOrProvinceCode>
                  <v12:PostalCode>90631-6126</v12:PostalCode>
                  <v12:UrbanizationCode>CO</v12:UrbanizationCode>
                  <v12:CountryCode>US</v12:CountryCode>
                  <v12:Residential>0</v12:Residential>
               </v12:Address>
            </v12:Recipient>
            <v12:ShippingChargesPayment>
               <v12:PaymentType>SENDER</v12:PaymentType>
               <v12:Payor>
                  <v12:ResponsibleParty>
                     <v12:AccountNumber></v12:AccountNumber>
                     <v12:Contact>
                        <v12:ContactId>RBB1057</v12:ContactId>
                        <v12:PersonName>ALPHA AND BRAVO BUILDINGS</v12:PersonName>
                        <v12:Title>abc</v12:Title>
                        <v12:CompanyName>Fedex</v12:CompanyName>
                        <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                        <v12:EMailAddress>Radhika_Margam@syntelinc.com</v12:EMailAddress>
                     </v12:Contact>
                  </v12:ResponsibleParty>
               </v12:Payor>
            </v12:ShippingChargesPayment>
            <v12:SpecialServicesRequested>
               <v12:SpecialServiceTypes>PENDING_SHIPMENT</v12:SpecialServiceTypes>
               <v12:ReturnShipmentDetail>
                  <v12:ReturnType>PENDING</v12:ReturnType>
                  <v12:ReturnEMailDetail>
                     <v12:MerchantPhoneNumber>1234566789</v12:MerchantPhoneNumber>
                     <v12:AllowedSpecialServices>SATURDAY_DELIVERY</v12:AllowedSpecialServices>
                  </v12:ReturnEMailDetail>
               </v12:ReturnShipmentDetail>
               <v12:PendingShipmentDetail>
                  <v12:Type>EMAIL</v12:Type>
                  <v12:ExpirationDate>2012-08-19</v12:ExpirationDate>
                  <v12:EmailLabelDetail>
                     <v12:NotificationEMailAddress>Radhika_Margam@syntelinc.com</v12:NotificationEMailAddress>
                     <v12:NotificationMessage>shipmentisdonetracpending</v12:NotificationMessage>
                  </v12:EmailLabelDetail>
               </v12:PendingShipmentDetail>
            </v12:SpecialServicesRequested>
            <v12:CustomsClearanceDetail>
               <v12:DutiesPayment>
                  <v12:PaymentType>SENDER</v12:PaymentType>
                  <v12:Payor>
                     <v12:ResponsibleParty>
                        <v12:AccountNumber>756942077</v12:AccountNumber>
                        <v12:Contact>
                           <v12:ContactId>RBB1057</v12:ContactId>
                           <v12:PersonName>WATER BASICS</v12:PersonName>
                           <v12:Title>abc</v12:Title>
                           <v12:CompanyName>Fedex</v12:CompanyName>
                           <v12:PhoneNumber>9762308621</v12:PhoneNumber>
                           <v12:EMailAddress>Radhika_Margam@syntelinc.com</v12:EMailAddress>
                        </v12:Contact>
                        <v12:Address>
                           <v12:StreetLines>GUSTAVO BAZ # 305</v12:StreetLines>
                           <v12:StreetLines>AV. ADOLFO RUIZ CORTINES, NO.2223</v12:StreetLines>
                           <v12:City>CENTRO</v12:City>
                           <v12:StateOrProvinceCode>TA</v12:StateOrProvinceCode>
                           <v12:PostalCode>86139</v12:PostalCode>
                           <v12:CountryCode>MX</v12:CountryCode>
                           <v12:Residential>0</v12:Residential>
                        </v12:Address>
                     </v12:ResponsibleParty>
                  </v12:Payor>
               </v12:DutiesPayment>
               <v12:CustomsValue>
                  <v12:Currency>USD</v12:Currency>
                  <v12:Amount>50.0</v12:Amount>
               </v12:CustomsValue>
               <v12:Commodities>
                  <v12:Name/>
                  <v12:NumberOfPieces>5</v12:NumberOfPieces>
                  <v12:Description>asa</v12:Description>
                  <v12:CountryOfManufacture>US</v12:CountryOfManufacture>
                  <v12:HarmonizedCode>1111</v12:HarmonizedCode>
                  <v12:Weight>
                     <v12:Units>LB</v12:Units>
                     <v12:Value>19999.0</v12:Value>
                  </v12:Weight>
                  <v12:Quantity>1</v12:Quantity>
                  <v12:QuantityUnits>LB</v12:QuantityUnits>
                  <v12:AdditionalMeasures>
                     <v12:Quantity>3</v12:Quantity>
                     <v12:Units>LB</v12:Units>
                  </v12:AdditionalMeasures>
                  <v12:UnitPrice>
                     <v12:Currency>USD</v12:Currency>
                     <v12:Amount>50.0</v12:Amount>
                  </v12:UnitPrice>
                  <v12:CustomsValue>
                     <v12:Currency>USD</v12:Currency>
                     <v12:Amount>50.0</v12:Amount>
                  </v12:CustomsValue>
                  <v12:ExciseConditions>
                     <v12:Category/>
                     <v12:Value/>
                  </v12:ExciseConditions>
                  <v12:ExportLicenseNumber>11111</v12:ExportLicenseNumber>
                  <v12:CIMarksAndNumbers/>
               </v12:Commodities>
            </v12:CustomsClearanceDetail>
            <v12:LabelSpecification>
               <v12:LabelFormatType>COMMON2D</v12:LabelFormatType>
               <v12:ImageType>PNG</v12:ImageType>
               <v12:LabelStockType>PAPER_4X6</v12:LabelStockType>
            </v12:LabelSpecification>
            <v12:RateRequestTypes>ACCOUNT</v12:RateRequestTypes>
            <v12:PackageCount>1</v12:PackageCount>
            <v12:RequestedPackageLineItems>
               <v12:SequenceNumber>1</v12:SequenceNumber>
               <v12:Weight>
                  <v12:Units>LB</v12:Units>
                  <v12:Value>20.0</v12:Value>
               </v12:Weight>
               <v12:Dimensions>
                  <v12:Length>18</v12:Length>
                  <v12:Width>16</v12:Width>
                  <v12:Height>15</v12:Height>
                  <v12:Units>IN</v12:Units>
               </v12:Dimensions>
               <v12:ItemDescription>String</v12:ItemDescription>
               <v12:CustomerReferences>
                  <v12:CustomerReferenceType>CUSTOMER_REFERENCE</v12:CustomerReferenceType>
                  <v12:Value>String</v12:Value>
               </v12:CustomerReferences>
            </v12:RequestedPackageLineItems>
        </v12:RequestedShipment>
      </v12:CreatePendingShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>
